       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG06A.
       ENVIRONMENT DIVISION.
       DATA DIVISION.    
       WORKING-STORAGE  SECTION.
       77 WRK-NOME PIC X(30).
       77 WRK-MATERIA PIC X(15).
       77 WRK-NOTA PIC 9(02).
       77 WRK-SITUACAO PIC X(20).
       77 WRK-CONTINUA PIC X(03).
       01 VAT-ELEM PIC 99 VALUE 10.
       01 MENORES PIC 99 VALUE 2.
       01 SUB PIC S9(03).

       PROCEDURE DIVISION.
       SOLICITA-INFORMACOES.
       MOVE SPACES TO WRK-NOME, WRK-MATERIA
       INITIALIZE WRK-NOTA

       DISPLAY 'POR FAVOR DIGITE SEU NOME'.
        ACCEPT WRK-NOME
       DISPLAY 'POR FAVOR DIGITE SUA MATERIA'.
        ACCEPT WRK-MATERIA
       DISPLAY 'POR FAVOR DIGITE SUA NOTA'.
        ACCEPT WRK-NOTA

       IF WRK-NOTA >= 0 AND WRK-NOTA <= 4
        MOVE 'REPROVADO' TO WRK-SITUACAO
       ELSE
        IF WRK-NOTA = 5 OR WRK-NOTA = 6
          MOVE 'EM RECUPERACAO' TO WRK-SITUACAO
        ELSE 
          IF WRK-NOTA >= 7 AND WRK-NOTA <= 10
            MOVE 'APROVADO' TO WRK-SITUACAO
          ELSE
              MOVE 'NOTA INVALIDA' TO WRK-SITUACAO
          END-IF
        END-IF
       END-IF
    
       DISPLAY 'OLA ' WRK-NOME 
       ' VOCE ESTA MATRICULADO NA MATERIA ' WRK-MATERIA
       ' E SUA NOTA FOI: ' WRK-NOTA
       ' E SUA SITUAÇAO FOI: ' WRK-SITUACAO.

        DISPLAY ' DESEJA FAZER NOVAMENTE?'.
           ACCEPT WRK-CONTINUA

        IF WRK-CONTINUA = 'S'
          GO TO SOLICITA-INFORMACOES
        END-IF

        DIVIDE MENORES BY  VAT-ELEM GIVING SUB 
        DISPLAY "SUBTRAÇÃO DOS 2 MENORES DO MAIOR: " SUB
      
       GOBACK.
       STOP RUN.
       END PROGRAM PROG06A.
